# ProjectId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDataInstanceAddedIntoDocumentEventArgs..::..ProjectId Property
ExternalDataInstanceAddedIntoDocumentEventArgs Class See Also
---
The id of the external project of the external data item to which a new reference has been added.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public string ProjectId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProjectId As String
	Get
```

Visual C++
---
```text
public:
property String^ ProjectId {
	String^ get ();
}
```

# See Also
ExternalDataInstanceAddedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace